export const SeasonalQuestions = {
  1: [
    { number: 1, text: `봄의 시작입니다. 당신은 무엇을 시작할 것인가요?` },
    { number: 2, text: `시작할 때는 두려움과 설렘 중 어떤 감정이 더 큰가요?` },
    { number: 3, text: `시작할 때는 두려움과 설렘 중 어떤 감정이 더 큰가요?` },
  ], // 입춘
  2: [
    {
      number: 1,
      text: `눈이 녹기 시작하는 날입니다. 지난 입춘에서 다짐한 일을 시작했나요?`,
    },
    { number: 2, text: `시작하고 보니 생각과는 달랐던 것이 있었나요?` },
    { number: 3, text: `눈이 녹고 따뜻해지면 하고 싶은 것이 있나요?` },
  ], // 우수
  3: [
    {
      number: 1,
      text: `개구리가 겨울잠에서 깨는 날입니다. 오늘 잠에서 깨어났을 때의 기분은 어땠나요?`,
    },
    { number: 2, text: `최근에 생생하게 꾼 꿈을 적어봐요.` },
    { number: 3, text: `깨어났을 때 처음 했던 생각은 어떤 것이었나요?` },
  ], // 경칩
  4: [
    {
      number: 1,
      text: `낮의 길이가 밤보다 길어지기 시작하는 날입니다. 요즘 무엇에 대해 이야기하는 것을 좋아하나요?`,
    },
    { number: 2, text: `나에게 매력적인 사람이란 어떤 사람일까요?` },
    { number: 3, text: `나의 매력은 어떤 것일까요?` },
  ], // 춘분
  5: [
    {
      number: 1,
      text: `봄의 날씨가 가장 좋은 날입니다. 날씨가 좋을 때는 어떤 것을 가장 하고 싶나요?`,
    },
    { number: 2, text: `날씨 덕분에 더 좋고, 행복하게 느껴진 순간이 있나요?` },
    { number: 3, text: `당신만의 봄을 느낄 수 있는 장소가 있나요?` },
  ], // 청명
  6: [
    {
      number: 1,
      text: `봄비가 내리는 날입니다. '비'라는 존재는 시련일까요, 양분일까요?`,
    },
    {
      number: 2,
      text: `겪을 당시에는 시련이었지만 나중에 보니 양분이 된 일이 있나요?`,
    },
    { number: 3, text: `다시 그 일을 마주한다면 어떻게 대처하고 싶은가요?` },
  ], // 곡우
  7: [
    { number: 1, text: `여름의 시작입니다. 지난 봄은 어땠는지 돌아볼까요?` },
    {
      number: 2,
      text: `이번 여름은 봄과 같이 보내고 싶은가요, 다르게 보내고 싶은가요?`,
    },
    { number: 3, text: `앞으로도 쭉 변하지 않았으면 하는 것이 있나요?` },
  ], // 입하
  8: [
    { number: 1, text: `소만 질문 1` },
    { number: 2, text: `소만 질문 2` },
    { number: 3, text: `소만 질문 3` },
  ], // 소만
  9: [
    {
      number: 1,
      text: `곡식의 씨앗을 뿌리는 날입니다. '아직 뿌리지 않은 씨앗'처럼, 오랫동안 하고 싶었지만 시도하지 않은 일이 있나요?`,
    },
    { number: 2, text: `시도하지 않았던 이유는 무엇일까요?` },
    { number: 3, text: `시도하기 위한 용기를 주는 존재가 있나요?` },
  ], // 망종
  10: [
    {
      number: 1,
      text: `낮이 가장 긴 날입니다. 오늘 당신을 웃게 한 사람이 있나요?`,
    },
    { number: 2, text: `오늘 당신을 불행하게 만든 사람이 있나요?` },
    { number: 3, text: `당신은 그 사람들에게 어떤 존재인가요?` },
  ], // 하지
  11: [
    {
      number: 1,
      text: `본격적으로 더위가 시작되는 날입니다. 매우 참기 힘든 유혹은 무엇인가요?`,
    },
    { number: 2, text: `유혹을 참기 위해 노력해본 것이 있나요?` },
    { number: 3, text: `노력하지 않아도 저절로 되는 나만의 것이 있나요?` },
  ], // 소서
  12: [
    {
      number: 1,
      text: `1년 중 가장 더운 날입니다. 당신만의 더위를 견디거나 즐기는 방식이 있나요?`,
    },
    {
      number: 2,
      text: `지금의 ‘더위’처럼 피할 수 없어서 견디거나 즐겼던 것이 있나요?`,
    },
    { number: 3, text: `견디고 나니 어땠나요?` },
  ], // 대서
  13: [
    {
      number: 1,
      text: `가을의 시작입니다. 지난 여름을 추억해볼까요? 어떤 일이 가장 기억에 남나요?`,
    },
    { number: 2, text: `어제의 나에게 해주고 싶은 말이 있나요?` },
    { number: 3, text: `더해서 내일의 나에게 해주고 싶은 말이 있나요?` },
  ], // 입추
  14: [
    {
      number: 1,
      text: `가을바람이 불기 시작하는 날입니다. 현재 읽고 있는 책이나 글이 있나요?`,
    },
    { number: 2, text: `오늘 하루와 어울리는 시나 노래 구절을 적어봐요.` },
    { number: 3, text: `지금 당장 떠날 수 있다면 어디로 갈 것인가요?` },
  ], // 처서
  15: [
    {
      number: 1,
      text: `찬 이슬이 맺히기 시작하는 날입니다. 나를 불행하게 만드는 것이 있나요?`,
    },
    { number: 2, text: `그것을 끊어내지 못하는 이유는 무엇일까요?` },
    {
      number: 3,
      text: `사람의 마음을 읽을 수 있다면 누구의 마음을 읽고 싶은가요?`,
    },
  ], // 백로
  16: [
    {
      number: 1,
      text: `밤의 길이가 낮보다 길어지기 시작하는 날입니다. 나의 미숙함이 느껴졌던 순간이 있나요?`,
    },
    { number: 2, text: `미숙하고 어리숙한 나를 바꿀 수 있는 방법이 있을까요?` },
    {
      number: 3,
      text: `바꾸지 않고 미숙한 나 자신 그대로를 사랑할 수 있을까요?`,
    },
  ], // 추분
  17: [
    {
      number: 1,
      text: `가을 단풍이 짙어지는 날입니다. 단풍처럼 요즘들어 뚜렷해진, 짙어진 나만의 것이 있나요?`,
    },
    { number: 2, text: `짙어지게 된 계기가 있나요?` },
    { number: 3, text: `반대로 옅어지게 된 것이 있나요?` },
  ], // 한로
  18: [
    {
      number: 1,
      text: `서리가 내리기 시작하는 날입니다. 나를 가장 방해하는 것은 무엇인가요?`,
    },
    { number: 2, text: `방해하는 것이 있다면 어떻게 대처하나요?` },
    { number: 3, text: `내가 가장 집중이 잘되는 공간은 어디인가요?` },
  ], // 상강
  19: [
    {
      number: 1,
      text: `겨울의 시작입니다. 좀 더 대담해져야 하는 일이 있나요?`,
    },
    { number: 2, text: `오늘 가장 견디기 어려웠던 것은 무엇인가요?` },
    { number: 3, text: `견디기 어려운 것이 있을 때의 마음가짐은 어떤가요?` },
  ], // 입동
  20: [
    {
      number: 1,
      text: `눈이 내리기 시작하는 날입니다. 오늘 나의 시선을 사로잡은 것은 무엇인가요?`,
    },
    { number: 2, text: `감쪽같이 사라졌으면 좋겠는 것은 무엇인가요?` },
    {
      number: 3,
      text: `반면에 자고 일어나면 감쪽같이 생겼으면 좋겠는 것은 무엇인가요?`,
    },
  ], // 소설
  21: [
    {
      number: 1,
      text: `1년 중 눈이 가장 많이 내리는 날입니다. 올해 얻은 가장 큰 교훈이 있나요?`,
    },
    { number: 2, text: `올해 생각보다 훨씬 잘 풀린 일이 있나요?` },
    { number: 3, text: `올해 생각보다 잘 풀리지 않은 일이 있나요?` },
  ], // 대설
  22: [
    {
      number: 1,
      text: `1년 중 낮이 가장 짧은 날입니다. 짧은 낮을 어떻게 보냈나요?`,
    },
    {
      number: 2,
      text: `길어진 밤, 잠에 잘 들었나요? 잠들기 전 가장 신경 쓰이는 것은 무엇인가요?`,
    },
    { number: 3, text: `잠들기 전 자신만의 루틴이 있나요?` },
  ], // 동지
  23: [
    {
      number: 1,
      text: `1년 중 가장 추운 날입니다. 시간이 느리게 흐르고 있나요, 아니면 빠르게 가고 있나요?`,
    },
    { number: 2, text: `시간을 멈추고 싶었던 순간이 있나요?` },
    { number: 3, text: `최근에 어떻게 지내고 있는지 궁금한 사람이 있나요?` },
  ], // 소한
  24: [
    {
      number: 1,
      text: `1년 중 큰 추위가 있는 날입니다. 요즘 내가 내려놓아야 할 것이 있다면 무엇일까요?`,
    },
    { number: 2, text: `스스로를 칭찬해주고 싶은 일이 있나요?` },
    { number: 3, text: `내게 용기를 주는 명언이나 문장이 있나요?` },
  ], // 대한
};
